[
	{
		"title": "Giada 0.15.2 <em>Smith Machine</em> released today",
		"date": "September 06, 2018",
		"body": "<p>Today we are proud to release Giada 0.15.2 <em>Smith Machine</em>, inspired by the so-called weight machine used for weight training. This new version introduces a list of satisfying features:</p><ul><li>a new logo, thanks to our friend <a href=\"https://github.com/k-syusteem\">k-syusteem</a>;<li>a new, sample-accurate and easier to use <strong>Action Editor</strong>, rewritten from scratch;</li><li>ability to edit <strong>MIDI Velocity</strong> in MIDI channels;</li><li>improved compatibility with those MIDI devices that send weird Note Off events (Note On + Velocity = 0);</li><li>many annoying bugs fixed, including a crash while opening plug-in windows on macOS;</li><li>other small improvements and minor fixes.</li></ul><p>The full changelog is available in <a href=\"https://giadamusic.com/download\">the download area</a>. A muscular \"thank you\" to all the contributors who inspired us with Giada 0.15.2!</p>"
	},		
	{
		"title": "Giada 0.15.1 <em>Leg Curl</em> is finally out",
		"date": "July 05, 2018",
		"body": "<p>Yesterday a new version of Giada, 0.15.1 codename <em>Leg Curl</em> appeared in bodily form, inspired by the fitness exercise that involves flexing the lower leg against resistance towards the buttocks.</p> <p>This version mainly features a huge internal refactoring of how Sample Channels and MIDI Channels get processed by the Audio Engine. This renovation opens up the doors to many new exciting functionalities planned for the 0.15 series - take a look <a href=\"https://github.com/monocasual/giada/issues?utf8=%E2%9C%93&q=is%3Aissue+milestone%3A%220.15+series%22+\">here</a> for the full list.</p> <p>In addition to that, we have also fixed a couple of bugs regarding plug-ins crashes on Linux and improved BPM changes detection while running Giada as JACK client.</p> <p>Full changelog + downloads available <a href=\"https://giadamusic.com/download\">here</a>. <img src=\"https://assets-cdn.github.com/images/icons/emoji/unicode/1f4aa.png\" style=\"height:2em\" alt=\"Stay strong.\"></a></p>"
	},	
	{
		"title": "Giada 0.15.0 <em>French Press</em> released",
		"date": "April 19, 2018",
		"body": "<p>Yesterday we released Giada 0.15.0, codename <em>French Press</em>, inspired by a famous type of strength exercise specially designed and most popular for triceps. This release brings on the table some important code refactoring that will pave the road for the upcoming new features planned for branch 0.15.</p><p>In addition to that, a smarter \"solo\" algorithm has been developed, as well as some nasty bugs on live recording fixed. Full changelog is available <a href=\"download\">here</a>. Go grab Giada 0.15.0 and stay strong.</p>"
	},
	{
		"title": "Giada 0.14.6 <em>Backward invention</em> is ready!",
		"date": "March 14, 2018",
		"body": "<p>We are happy to present a new juicy version of Giada, inspired by the so-called <em>backward invention</em>: a marketing strategy in which an existing product is dumbed down by the company to be released in less developed countries.</p><p>In Giada 0.14.6 you will find:</p><ul><li>Ability to drive volume of one-shot samples via MIDI velocity;</li><li>FLAC and Ogg support for audio files;</li><li>Build system improvements;</li><li>Several bugs fixed, especially the crash on macOS when opening the Configuration window.</li></ul><p>Also, Giada 0.14.6 marks the end of the 0.14 series. We are getting ready for some exciting new features in the 0.15 branch, such as the free loop length or the ability to record on key press/input signal.</p><p>As always, downloads and changelog are <a href=\"https://www.giadamusic.com/download\">right here</a>. Warm hugs to our supporters, stay tuned!</p>"
	},
	{
		"title": "Giada, version 0.14.5 <em>The Purkinje Effect</em> released today",
		"date": "January 15, 2018",
		"body": "<p>Ladies and Gentlemen, we salute the new year with another shiny release of Giada, version 0.14.5 \"The Purkinje Effect\": the change in perception of colors as illumination changes from daylight to twilight.</p><p>It took us a while to release it: we completely overhauled our automatic deployment system in order to generate new, beautiful binary packages.</p><p>So what's new in Giada 0.14.5 \"The Purkinje Effect\"?</p><ul><li><p>AppImage executable for Linux;</p></li><li><p>OS X builds on Travis CI;</p></li><li><p>Support for multiple plug-in directories with the new Directory Browser: no more writing paths by hand!;</p></li><li><p>MIDI input filtering;</p></li><li><p>Improved MIDI action management in Piano Roll;</p></li><li><p>Several bugs and crashes fixed.</p></li></ul><p>The full changelog is available <a href=\"https://giadamusic.com/download\">here</a>.</p>"
	},
	{
		"title": "Giada 0.14.4 <em>Acheiropoieta</em> is ready",
		"date": "October 28, 2017",
		"body": "<p>A new release of Giada is ready for your desktop. This version has been inspired by the so-called <em>Acheiropoieta images</em>, or icons made without hands — religious drawings which are said to have come into existence miraculously, not created by a human.</p><p>In Giada 0.14.4 you will find:</p><ul><li><p><strong>renameable channels</strong>;</p></li><li><p><strong>portable VST path</strong> — plug-ins are now stored in patch files with a special, filesystem-independent hash, so that you can share your projects across different computers. Just make sure you have the same plug-ins installed;</p></li><li><p>new <strong>Sample shift tool</strong> in Sample Editor;</p></li><li><p>ability to process more than one plug-in instrument at once — you can now create multi-layered instruments for powerful walls of sounds;</p></li><li><p>many bugs fixed, minor improvements and user interface beautifications.</p></li></ul><p>As always, the full changelog is available <a href=\"https://www.giadamusic.com/download\">here</a>. A big \"thank you\" to all the people, both physical and spiritual, involved with this release.</p>"
	},
	{
		"title": "Giada meets Docker",
		"date": "October 07, 2017",
		"body": "<p>Dear developers, building Giada from source has never been easier! We have just released <a href=\"https://github.com/monocasual/giada-docker\">the official Docker image</a> for Giada Loop Machine, baked with much love in our laboratories to soothe the compilation/testing process.</p><p>No more cluttering up your environment and hunting for dependencies that are nowhere to be found: everything is shipped within the image you will download from the Docker Hub. Take a look at the <a href=\"https://github.com/monocasual/giada-docker/blob/master/README.md\">README file</a> for more information.</p><p>As always, we love your feedback: please help us making the workflow more and more awesome <img width=\"25px\" src=\"https://assets-cdn.github.com/images/icons/emoji/unicode/1f60d.png\" alt=\"heart-eyes\">.</p>"
	},
	{
		"title": "Giada 0.14.3 <em>Yeasts</em> is out now!",
		"date": "September 20, 2017",
		"body": "<p>Yesterday we released a new shiny version of Giada, code name <em>Yeasts</em>, inspired by the magical kingdom of fungi. What's new in Giada 0.14.3:</p><ul><li>vertically-resizable channels;</li><li>lots of new operations in the Sample Editor: \"copy/paste\", \"reverse\", \"normalize hard\" and \"copy to new channel\";</li><li>improved UI management of VST plugins;</li><li>many bugs fixed and minor improvements.</li></ul><p>The full changelog is available <a href=\"https://www.giadamusic.com/download\">here</a>. Keep an eye on the documentation area, as we are updating it to reflect the numerous changes introduced in the Sample Editor.</p><p>Have fun and enjoy the fermentation.</p>"
	},
	{
		"title": "Giada 0.14.2 <em>Ichthys</em> out today",
		"date": "August 14, 2017",
		"body": "<p>Giada 0.14.2 <em>Ichthys</em> (a.k.a. <a href=\"https://en.wikipedia.org/wiki/Ichthys\">The Jesus fish</a>) has just been released. \"Ichthys\" is also known as the \"Jesus fish\", a symbol used by ancient Christians to mark meeting places. The new release unearths more and more powerful tools from the Sample Editor:</p><ul><li><p><strong>Audible preview</strong> — with optional loop mode and keyboard shortcuts;</p></li><li><p>Frame-precise waveform editing;</p></li><li><p>Show sample's information — size, bit depth, frequency, ...;</p></li><li><p>improved fade-out algorithm and waveform drawing;</p></li></ul><p>And on top of that, Giada 0.14.2 features some serious improvements to the memory management, a revamped \"clear empty columns\" operation, several external dependencies upgraded.</p><p>Full changelog available <a href=\"https://www.giadamusic.com/download\">here</a>. Enjoy!</p>"
	},
	{
		"title": "Giada 0.14.1 <em>Book of Shadows</em> out today",
		"date": "July 17, 2017",
		"body": "<p>Today we released a new version of Giada, codename <em>Book of Shadows</em>: a book containing religious texts and instructions for magical rituals found within the Neopagan religion of Wicca. As outlined in the 0.14 branch, the saga of Sample Editor's rewrite continues. Some notable changes:</p><ul><li><strong>Show play head in Sample Editor</strong> — know what you are playing!</li><li>many under-the-hood improvements to the waveform drawing algorithm;</li><li>fix a nasty crash when recording with beats/bars greater than 4/1;</li><li>upgrade <strong>JUCE</strong> to version 5.</li></ul><p>As always the full changelog is available <a href=\"https://www.giadamusic.com/download\">here</a>. A warm kiss to all our supporters.</p>"
	},
	{
		"title": "Giada 0.14.0 <em>DNS_PROBE_FINISHED_NO_INTERNET</em> released today",
		"date": "May 30, 2017",
		"body": "<p>Let's roll out the red carpet for the new version of Giada, number 0.14.0 codename <em>DNS_PROBE_FINISHED_NO_INTERNET</em>, inspired by the Chrome/Chromium error flag raised when your Internet connection is dead.</p><p>The light at the end of the 1.0 tunnel still shines far away. However, starting from the current branch 0.14 we want to pave the road for a kick-ass live audio production tool, easy, reliable and fun to use. So, enjoy some delicious features from the current release:</p><ul><li>a deeply polished and reorganized <strong>Sample Editor</strong>;</li><li>ability to toggle <strong>input monitoring</strong> while recording audio;</li><li>support for old .ini patch files removed;</li><li>lots of code refactoring and bugs fixed.</li></ul><p>The full changelog is available <a href=\"https://www.giadamusic.com/download\">here</a>. A warm kiss to all supporters, bug reporters and hackers.</p>"
	},
	{
		"title": "Giada 0.13.4 \"Gimbal Lock\" is out",
		"date": "April 25, 2017",
		"body": "<p>Today we shipped a new version of Giada codename \"Gimbal Lock\", a common glitch that occurs when rotating an object in a 3-dimensional space.</p><p>The release offers an improved MIDI editing experience, especially on the Piano Roll side. We also removed the ability to load deprecated MIDI maps files (i.e. those still based on .ini files) and expanded the unit test collection.</p><p>As always, a warm \"thank you\" to all the contributors. The full changelog is available <a href=\"https://www.giadamusic.com/download\">here</a>. Enjoy the novelties of Giada 0.13.4 and remember: beware of gimbal locks!</p>"
	},
	{
		"title": "Giada 0.13.3 <em>Chrysopoeia</em>",
		"date": "March 24, 2017",
		"body": "<p>A new version of Giada, 0.13.3 codename <em>chrysopoeia</em> is ready for your hardware! In alchemy, the term <em>chrysopoeia</em> (Greek: χρυσοποιία) means transmutation into gold (from the Greek χρυσός khrusos, \"gold,\" and ποιεῖν poiēin, \"to make\"). It is symbolically used to indicate the creation of the philosopher's stone and the completion of the Great Work.</p><p>The new release features a deep rework of <strong>Jack implementation</strong>, which provides BPM and Rewind synchronization. We have also fixed some annoying bugs like <a href=\"https://github.com/monocasual/giada/issues/99\">GitHub issue #99</a>, improved the 'free channel' function and cleaned up the codebase even further.</p>"
	},
	{
		"title": "Giada tutorial #5 - Audio recording ",
		"date": "February 17, 2017",
		"body": "<p>Say \"Hi\" to our new digital friend Bartholomew Davenport! He is the guy who will guide us through the art of audio recording with Giada. In his new tutorial #5 you'll learn how to create a live, loop-based performance with physical instruments and a couple of sample channels. The result: an awesome drone-oriented soundtrack texture built in less than 4 minutes. Must watch.</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/L66CA1Umk4w\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada 0.13.2 \"Raudive Tapes\" out now",
		"date": "January 13, 2017",
		"body": "<p>A new smashing version of Giada is ready for your desktop. Inspired by Konstantīns Raudive, a guy who investigated electronic voice phenomena (EVP), this release provides <strong>MIDI learn for plugins parameters</strong>. From now on you can let your favorite MIDI hardware control any VST effect or VST instrument: a golden feature for live performing.</p><p>In addition we added the ability to toggle hidden files in File Browser, fortified plugin loading, fixed lots of bugs plus the usual overall cleanup. Enjoy!</p>"
	},
	{
		"title": "New \"Press\" area available",
		"date": "December 11, 2016",
		"body": "<p>Journalists, writers, bloggers, instagrammers: we are pleased to announce the new <a href=\"https://www.giadamusic.com/press/\">Press area</a> on our official website. There you will find press reviews, hi-resolution logos and artworks, social media links and everything else you need to write truly unbiased articles on your favorite piece of software. Go spread the word!</p>"
	},
	{
		"title": "Giada 0.13.1 <em>The Shunned House</em> is out",
		"date": "November 18, 2016",
		"body": "<p>Yesterday we released a new shining version of Giada, number 0.13.1 codename <em>The Shunned House</em>, inspired by the short horror story by H.P. Lovecraft. This episode brings many exciting features:</p><ul><li><p><strong>MIDI messages to channels/plugins</strong> — now you can play and record your favorite VST instruments through a MIDI keyboard/controller;</p></li><li><p>revamped <strong>input dynamics</strong> — record actions and sounds is now easier, faster and more intuitive. The new built-in input monitor makes live performances a breeze;</p></li><li><p>many nasty bugs fixed, e.g. crashes on OS X, missing ASIO and WASAPI on Windows, several glitches during action recording process;</p></li><li><p>many UI improvements and other under-the-hood tweaks.</p></li></ul><p>A warm hug to all of you who helped with this release.</p>"
	},
	{
		"title": "Giada 0.13.0 <em>Understanding Eigenvalues</em> released",
		"date": "September 19, 2016",
		"body": "<p>Today we decided to celebrate the end of Summer with a powerful new release of Giada, codename <em>Understanding Eigenvalues</em>. This version marks the beginning of the 0.13 series, where <a href=\"https://github.com/monocasual/giada/milestone/3\">several amazing features</a> are planned.</p><p>What's new in this 0.13.0 version, anyway?</p><ul><li>Revamped <strong>file browser</strong> — faster file handling, with the ability to load patches/projects/samples on double click. The browser is now smart enough to remember scroll position and the last selected item on opening;</li><li>New <strong>64-bit packages for Windows</strong>. We also dropped support for any other 32-bit package (Ubuntu included, <a href=\"http://www.omgubuntu.co.uk/2016/06/ubuntu-drop-32-bit-desktop-iso-image-installer\">we are future-proof</a>!)</li><li>Build process improved and polished, especially for GCC 6;</li><li>Update JUCE to version 4.2.3, with source code reorganization;</li><li>Several crashes fixed, tons of minor bugs squashed (and introduced :))</li></ul><p>Bonus point: we have also upgraded <a href=\"forum\">our official forum</a> to the latest version of phpBB. As always, a warm \"thank you\" to all the contributors who helped with the development of this release.</p>"
	},
	{
		"title": "New video tutorial #3 - The Action Editor",
		"date": "September 06, 2016",
		"body": "<p>There's a fresh new video tutorial available in the <a href=\"http://www.youtube.com/user/GiadaLoopMachine\">official Youtube channel of Giada Loop Machine</a>. This time Richard P. Aspromonte will guide us through the perils of the legendary Action Editor, a tool used for editing actions. He will eventually lay down some 80s/90s hip hop beats using samples from the glorious \"The Bridge\" by Mc Shan. </p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/UN7Uq9Kahqw\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada 0.12.2 \"Flatland\" released",
		"date": "June 04, 2016",
		"body": "<p>Giada 0.12.2, codename \"Flatland\" is ready for your machine. With this version we introduced quite a few inner changes:</p><ul><li><p>Upgrade RtAudio to version 4.1.2 ― thanks to this change we can provide WASAPI support on Windows. We also simplified a lot the inclusion of RtAudio dependency when compiling Giada from source code;</p></li><li><p>plugin management improvements ― you can now sort the plugin list by name, manufacturer and type; the plugin window's size and position are finally stored properly in the configuration file;</p></li><li><p>nasty crashes on OS X El Capitan fixed;</p></li><li><p>minor code cleanups.</p></li></ul><p>A big hug to all the people who helped with the bug hunting on OS X. Get ready for lots of new amazing breakdowns with the WASAPI thing :)</p>"
	},
	{
		"title": "Giada 0.12.1 \"Permutations\"",
		"date": "May 06, 2016",
		"body": "<p>Today we released Giada 0.12.1, codename <em>Permutations</em>. In mathematics, the notion of permutation relates to the act of arranging all the members of a set into some sequence or order. This time we focused almost exclusively on audio plugin management, with useful features like the percentage progress for plugin scan and notifications for missing/unknown VSTs. We would also like to thank everyone who reported <a href=\"forum/crash-on-launch-el-cap-10-11-4-t1382.html\">nasty crashes on OS X El Capitan</a>: an investigation is underway!</p>"
	},
	{
		"title": "New tutorial #2 remake: happy looping",
		"date": "April 01, 2016",
		"body": "<p>Today our digital friend Richard released another great remake of the original tutorial series. This time he will introduce us to the world of looping, how the main sequencers works and what we can do with it.</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/4SDAx2kqP8Y\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "New release: Giada 0.12.0",
		"date": "March 07, 2016",
		"body": "<p>Today we released Giada 0.12.0, codename <em>Resilience</em>. This version brings big under-the-hood changes: the whole audio plugin layer has been ported to <a href=\"https://www.juce.com/\">JUCE framework</a>. This internal improvement gives us a more stable and professional VST plugin support, with many other formats available in the near future (VST3, AU, LADSPA). Isn't it great? In Giada 0.12.0 you will also find:</p><ul><li><p>64-bit binaries for OS X (and discontinued support for 32-bit ones);</p></li><li><p>overall GUI beautification;</p></li><li><p>improved test suite;</p></li><li><p>lots of minor cleanups and fixes.</p></li></ul><p>Changes were quite substantial this time, so expect some bugs here and there. Feel free to report any weirdness!</p>"
	},
	{
		"title": "What's going on with Giada 0.12.x?",
		"date": "February 19, 2016",
		"body": "<p>Development on 0.12 branch is going on swiftly: we are porting the whole plugin/VST layer to <a href=\"https://www.juce.com/\">Juce framework</a>. Meanwhile, technicians at Monocasual Laboratories have leaked a highly-sensitive screenshot that shows the current stage of development. You can clearly see the list of available plugins, various information and the ability to add them to some kind of plugin stack. It definitely looks promising. We are all looking forward to see it live and running!</p><p><img class=\"img-responsive center-block\" alt=\"Giada VST list leaked screenshot\" src=\"https://s3.amazonaws.com/images.giadamusic.com/promo/giada-vst-list-leaked.png\"></p>"
	},
	{
		"title": "Giada 0.11.2 <em>Pareto principle</em> released",
		"date": "January 15, 2016",
		"body": "<p>A new awesome release of Giada, codename <em>Pareto principle</em> is ready for your hardware. The Pareto principle states that, for many events, roughly 80% of the effects come from 20% of the causes. What's new in this version:</p><ul>  <li>Support for <strong>JSON-based midimap files</strong>;</li>  <li>Add new channel by right-clicking anywhere on a column;</li>  <li>Fixes for many compilation warnings on GCC 5.3 (and LLVM as well);</li>  <li>Fix for a nasty bug that prevented MIDI Jack from being selected on Linux.</li></ul><p>The old-school midimap files are now deprecated, but still supported — not for long, though! Giada 0.11.2 <em>Pareto principle</em> also marks the end of the 0.11 series. Expect some exciting news from the future, such as porting to <a href=\"http://www.juce.com/\">JUCE framework</a>: VST3 and OSC support and many other delicacies.</p>"
	},
	{
		"title": "Tutorial #1 revamped and reloaded",
		"date": "December 28, 2015",
		"body": "<p>What's the best way to salute the new year? With a remake of the Giada tutorial's first episode made by our fellow youtuber Richard, of course! In this introductory chapter he shows the basic differences between sample channels and MIDI channels, and how to initialize them. A great way to get your feet wet with Giada Loop Machine.</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/S_eLFrwVwKY\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada 0.11.1 out today!",
		"date": "December 21, 2015",
		"body": "<p>A new smashing release of Giada - 0.11.1 <em>Càdlàg functions</em> - is ready for your desktop. Main features:</p><ul><li>ability to <strong>clone channels</strong>;</li><li>new <strong>JSON-based</strong> configuration file;</li><li>usability improvements in Configuration panel;</li><li>many stability enhancements and fixes;</li><li>lots of bugs fixed.</li></ul><p>We have also updated the documentation and added more information on how to run unit tests with <a href=\"https://github.com/philsquared/Catch\">Catch</a>. Have fun!</p>"
	},
	{
		"title": "Giada 0.11.0 released!",
		"date": "December 01, 2015",
		"body": "<p>Today we are proud to celebrate the new release 0.11.0, codename <em>Self-similarity</em>. Self-similarity is an important property of <a href=\"https://en.wikipedia.org/wiki/Fractal\">fractal objects</a>. This version features lots of under-the-hood improvements:</p><ul><li>New <strong>JSON-based patch system</strong> — forget the old, buggy, messy patches: now they are clear and beautiful JSON files, easy to read and to manage. You can even generate them via scripts, if you like it!;</li><li>ability to save and restore column widths;</li><li>more code reorganization and cleanups;</li><li>lots of bugs fixed.</li></ul><p>Of course Giada can still work with the old patch system, but being it deprecated it will be removed sooner or later. So please convert your patches to the new JSON format: you just need to save them over again.</p>"
	},
	{
		"title": "Giada 0.10.2 <em>Benford's Law</em> released today",
		"date": "October 20, 2015",
		"body": "<p>Giada 0.10.2, codename <em>Benford's Law</em> is out today. This is the last release in the 0.10 branch, with several interesting news:</p><ul><li>support for test-driven development — thanks to <a href=\"https://github.com/philsquared/Catch\">Catch</a> and <a href=\"https://travis-ci.org/\">Travis CI</a> for continuous integration;</li><li>improved behavior of some loop modes;</li><li>tons of nasty bugs fixed.</li></ul><p>We are also packing our stuff for the 0.11 series. Lots of goodies are coming from the labs!</p>"
	},
	{
		"title": "New video tutorial #8: loop modes overview",
		"date": "October 09, 2015",
		"body": "<p>Another smashing tutorial by Richard Aspromonte! This time he will walk us through the land of Loop modes. You will learn how to handle Giada as a loop machine, building your live performance from the ground up.</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/dYKxUZgsB-o\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada 0.10.1 out now",
		"date": "August 26, 2015",
		"body": "<p>Today we released Giada 0.10.1, codename <em>Pascal's Triangle</em>. <a href=\"http://www.livescience.com/51238-properties-of-pascals-triangle.html\">Pascal's Triangle</a> is an arithmetical triangle and is commonly used in probability. During the hot summer days we realized that Giada's codebase is growing big and strong, especially if we look at the future roadmap. So in this new release we decided to:</p><ul>  <li>completely refactor the source folder structure — now easier to browse and to work with;</li>  <li>improve the build system and fix many annoying issues.</li></ul><p>Giada 0.10.1 also features improved usability for 'play/stop' channel buttons and the usual set of bugs fixed/cleanups.</p>"
	},
	{
		"title": "Giada 0.10.0 <em>Astraphobia</em> released",
		"date": "July 04, 2015",
		"body": "<p>Today we celebrate the new branch 0.10.x with a new, juicy feature: MIDI lightning! Born as a proof of concept by our GitHub friend Blablack, Giada is now able to light up your MIDI device's knobs and buttons, by sending custom MIDI messages. Of course this is an experimental feature, we need your help! Test the new functionality and submit new midimap files on the <a href=\"https://github.com/monocasual/giada-midimaps\">official midimaps repo</a>. More information on our <a href=\"http://giadamusic.com/documentation/show/midi-output-management\">documentation pages</a>.  </p>"
	},
	{
		"title": "New video tutorial on sample modes",
		"date": "May 31, 2015",
		"body": "<p>Our new digital friend Richard Aspromonte introduces us to the joyful world of sample channels. What are \"one shot\" modes? How can I use them properly? In this tutorial you will learn how to handle Giada as a drum machine/sample player/soundscape generator.</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/7sU_RbGWNAs\" frameborder=\"0\" allowfullscreen=\"\"></iframe>"
	},
	{
		"title": "Giada 0.9.6 <em>Flammarion engraving</em> released",
		"date": "May 10, 2015",
		"body": "<p>Today we release a brand new version of Giada Loop Machine, codename <em>Flammarion engraving</em>. The name comes from <a href=\"http://en.wikipedia.org/wiki/Flammarion_engraving\">a wood engraving</a> by an unknown artist, often used as a metaphorical illustration of either the scientific or the mystical quests for knowledge.</p><p>The release provides a bunch of delicious features, namely:</p><ul><li>Keyboard binding for MIDI channels</li><li>Support for multiple files in drag-n-drop operations</li><li>Different color for wait/end statuses</li><li>Lots of bugs fixed and other minor improvements.</li></ul><p>The 0.9.6 version also marks the end of the 0.9.x series. We have planned great improvements for Giada 0.10.x, such as the MIDI lightning support, MIDI input to channels/VSTs, a big source code refactoring and a starting setup for TDD development. The mystical quest for knowledge has never been so exciting!</p>"
	},
	{
		"title": "Libremusicproduction interview",
		"date": "April 08, 2015",
		"body": "<p>The guys at LMP have just published <a href=\"http://libremusicproduction.com/articles/lmp-asks-7-interview-giovanni-zuliani\">a great interview</a> to our supreme head technician on their web magazine. A nice trip through one of the most unstable minds of modern time. The article also features a set of obscure screenshots of Giada from the past: you definitely don't want to miss it! Thank you <a href=\"http://libremusicproduction.com/\">libremusicproduction.com</a> for your sweet support.</p>"
	},
	{
		"title": "Giada 0.9.5 <em>Nabla Symbols</em> released",
		"date": "March 28, 2015",
		"body": "<p>Another shiny release of Giada Loop Machine, codename <em>Nabla Symbols</em> is ready for your desktops. Main changes:</p><ul><li>Better column resize algorithm;</li><li>New patch loading system with permanent MIDI mapping;</li><li>Ability to clear assigned keys (keyboard mode);</li><li>Minor fixes and tweaks.</li></ul><p>From now on we provide MD5 checksums for our packages (in the <a href=\"/download\">download</a> page). We also no longer ship raw binary Linux versions. Save bandwidth, save the planet!</p>"
	},
	{
		"title": "Giada 0.9.4 \"Bayes' theorem\" released",
		"date": "February 25, 2015",
		"body": "<p>Today we released a new version of Giada Loop Machine, codename <em>Bayes' theorem</em>. This release brings some nice minor features and fixes. Changelog:</p><ul><li>Drag-n-drop now works also in existing channels;</li><li>Store 'resize recordings' flag in giada.conf;</li><li>Better management of duplicate samples;</li><li>Add more VST debug information;</li><li>Minor fixes and tweaks.</li></ul>"
	},
	{
		"title": "Giada 0.9.3 \"Terraforming\" released!",
		"date": "January 31, 2015",
		"body": "<p>We proudly present to you another interstellar version of Giada, codename <em>Terraforming</em>, released today. What's going on inside of it?</p><ul><li>Several <strong>GUI improvements</strong> — resizable columns, better column handling mechanism, many graphical glitches fixed;</li><li>upgrade to FLTK 1.3.3;</li><li>support for <strong>MIDI devices without Note Off message</strong> — some controllers use a different Note Off technique: they send a Note On with velocity at 0 or 127. Now Giada can understand it, thanks to the brilliant work of our friend <a href=\"https://github.com/blablack\">blablack</a>;</li><li>many bugs fixed and internal improvements.</li></ul>"
	},
	{
		"title": "Testing Giada episode 2 - (Drag and) Drop da beat",
		"date": "December 06, 2014",
		"body": "<p>In the following video we want to test the new drag and drop feature introduced in version 0.9.2. No more \"click here and here\", please!</p><div class=\"embed-responsive embed-responsive-16by9\"><iframe class=\"embed-responsive-item\" width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/2h1pallZ020\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada 0.9.2 \"Bethlehem\" is out today!",
		"date": "November 29, 2014",
		"body": "<p>As the cold winter wind starts to blow out there, we release one of the hottest packages of December: Giada 0.9.2, codename <em>Bethlehem</em>! This version contains two very exciting features:</p><ul><li>New <strong>grid tool</strong> for the Sample Editor – cutting and chopping samples as never seen before;</li><li>load samples via <strong>drag and drop</strong>;</li><li>fix compilation issues on some Linux distros;</li><li>many internal optimizations and bugs fixed.</li></ul><p>As usual, a warm \"thank you\" to all our testers, bug-reporters, packagers and supporters.</p>"
	},
	{
		"title": "The grid of astonishment, alpha version",
		"date": "November 09, 2014",
		"body": "<p>Dear loopers and hackers, we are working on a new powerful grid system for the Sample Editor. Lots of configurations, 100% snappable guaranteed. Available soon on your Giada Loop Machine 0.9.2!<br /><br /><img class=\"img-responsive\" src=\"https://pbs.twimg.com/media/B174-x9IQAEz8nm.png:large\" alt=\"Giada Loop Machine grid tool\" /></p>"
	},
	{
		"title": "Giada 0.9.1 \"Chandrasekhar\" on your desktop",
		"date": "September 24, 2014",
		"body": "<p>Today we released Giada 0.9.1, codename <em>Chandrasekhar</em>, a bug fixing release which features:</p><ul><li>fix startup crash on OS X;</li><li>restore custom version of RtAudio;</li><li>other minor fixes and usability improvements.</li></ul><p>We also decided to make this very website fully open-source by pushing the code on GitHub, in the <a href=\"https://github.com/monocasual/giada-www\">official repo</a>. Fork it, blend it, destroy it, be inspired by it!</p>"
	},
	{
		"title": "Giada 0.9 ready for your devices",
		"date": "August 17, 2014",
		"body": "<p>We are very glad to kick off the new branch 0.9 with <em>Central limit</em>, a sparkling release rich of features and surprises:</p><ul><li>Deep GUI redesign with full-screen support;</li><li>New multi-column layout;</li><li>New advanced logging system.</li></ul><p>We also made the configure scripts a lot smarter, smashed many bugs and made copious invisible improvements. Have fun!</p>"
	},
	{
		"title": "Celebrating web craftsmanship",
		"date": "July 15, 2014",
		"body": "We are very happy to introduce you our brand new website, crafted with love and usability in mind. Please feel free to report any broken links or strange bugs you might find. Enjoy!"
	},
	{
		"title": "Smooth development in June 2014",
		"date": "June 10, 2014",
		"body": "<p>Lots of things are going on these days in our secret laboratories. First, we are rewriting this website from scratch, based on modern and powerful technologies such as <a href=\"http://phalconphp.com/en/\">Phalcon Framework</a>, <a href=\"https://angularjs.org/\">AngularJS</a> and <a href=\"http://getbootstrap.com/\">Twitter Bootstrap</a>. Second, the development of 0.9 series goes on steadily: a forbidden screenshot has leaked online showing the new full-screen, multi-column layout!</p>"
	},
	{
		"title": "Giada 0.8.4, here we go!",
		"date": "March 26, 2014",
		"body": "<p>Giada Loop Machine 0.8.4, codename <em>Gevurah</em> is finally ready. It features a magnificent new <strong>loop once bar</strong> mode, tons of internal (and invisible) improvements and bugs fixed. We are also happy to announce the end of the 0.8 series. Let's get ready for a new era of exciting new features, like the full screen mode and the multi-column layout. Happy looping!</p>"
	},
	{
		"title": "Giada Loop Machine version 0.8.3",
		"date": "February 13, 2014",
		"body": "<p>Giada 0.8.3, codename <em>196 layers</em> is out today. Top features:</p><ul><li>Experimental <strong>MIDI timing output</strong> with <strong>MTC</strong> and <strong>MIDI clock</strong>;</li><li>New pitch operators <strong>x2</strong> and <strong>/2</strong>;</li><li>Many nasty bugs fixed and other minor improvements done.</li></ul><p>MIDI Time Code is very experimental, please report any issue you may be experiencing. Thank you all guys!</p>"
	},
	{
		"title": "Giada Loop Machine version 0.8.2",
		"date": "January 13, 2014",
		"body": "<p>Giada 0.8.2, codename <em>Golden Globe Awards</em> is now ready for the masses. Top features:</p><ul><li>Pitch control exposed via MIDI;</li><li>New tools in Sample Editor (linear fade in/out, smooth edges);</li><li>Enhanced VST MIDI event support;</li><li>Tons of bugs fixed and internal improvements.</li></ul><p>And of course a big \"thank you\" to all our beloved supporters out there!</p>"
	},
	{
		"title": "Testing Giada episode 1",
		"date": "December 14, 2013",
		"body": "<p>In <a title=\"Testing Giada 1 - High quality pitch control\" href=\"http://www.youtube.com/watch?v=Ge5J6H7k0D4\">this video</a> we borrow the glorious Amen break from the late 90's to see how well the new pitch control works. Some glitches here and there (already fixed in the development version) but the overall impression is definitely good!﻿</p><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/Ge5J6H7k0D4\" frameborder=\"0\" allowfullscreen></iframe>"
	},
	{
		"title": "Giada Loop Machine 0.8.1",
		"date": "December 08, 2013",
		"body": "<p>Giada 0.8.1, codename <em>Jack Sparrow</em> is finally ready for download. Main new features:</p><ul><li>new high quality <strong>pitch control</strong>, based on libsamplerate;</li><li>spread sample to bar, spread sample to song functions.</li></ul><p>We also want to welcome a new section of giadamusic.com in which we store our beloved source code, plus the Flattr button up here.</p>"
	},
	{
		"title": "Giada Loop Machine 0.8.0",
		"date": "November 03, 2013",
		"body": "<p>Giada 0.8.0, codename <em>benzoyl peroxide</em> is out today, introducing a long-awaited (by us, at least) feature: initial <strong>MIDI input</strong> support! The release also fixes many annoying bugs and introduces some minor improvements.</p>"
	},
	{
		"title": "Autumnal news part 2",
		"date": "October 16, 2013",
		"body": "<p>While MIDI input development goes on smoothly on GitHub, we are pleased to recommend you another thrilling demo video called <a href=\"http://www.youtube.com/watch?v=8gWjzgOitfs\" title=\"Giada Loop Machine demo 2 - The Beauty \">\"The Beauty\"</a>, plus a in-depth review of Giada 0.7.3 on <a href=\"http://edgarleonelcs.blogspot.mx/2013/09/software-giada.html\" title=\"\">Leo Cabrera's blog</a> (Spanish only, but Google Translate is your friend).</p>"
	},
	{
		"title": "Autumnal news",
		"date": "September 28, 2013",
		"body": "<p>Giada is ready to face the dark seasons on the horizon (at least in this hemisphere) with some interesting news: new demo video \"Dubteque\" available on <a href=\"https://www.youtube.com/watch?v=HnwFLpd-gvo\">Youtube</a>, completely revised and enhanced documentation and a new official <a href=\"https://plus.google.com/103544024553691934077/posts\">profile</a> on Google  network.</p>"
	},
	{
		"title": "Giada Loop Machine 0.7.3 out today",
		"date": "September 16, 2013",
		"body": "<p>Giada 0.7.3, codename <em>klickibunti</em> is finally available! Here's the list of the unbelievable features:</p><ul><li>experimental <strong>64 bit</strong> version for Linux;</li><li>many many improvements in the <strong>Piano Roll tool</strong>;</li><li>massive internal cleanup - Giada is now ready for future development;</li><li>copious bugs fixed and minor improvements.</li></ul><p>This version will probably be the last one in the 0.7 adventure. A big thanks to all of our friends/supporters!</p>"
	},
	{
		"title": "Giada Loop Machine 0.7.2 out today",
		"date": "July 26, 2013",
		"body": "Giada 0.7.2, codename <em>0x90323F00</em> is now available, with its list of new, appetizing features:</p><ul><li>initial <strong>MIDI output</strong> support on multiple channels (1-16);</li><li>a complete rewrite of the VST GUI part on OS X: better design, more stability, less/no crashes;</li><li>many improvements on the internal MIDI routing;</li><li>usual bugfixing and cleanups.</li></ul><p>As always, we want to thank our precious supporters with their ideas and suggestions."
	},
	{
		"title": "Giada Loop Machine 0.7.1",
		"date": "June 27, 2013",
		"body": "<p>Giada 0.7.1 <em>summer forgiveness</em> is out today! What's new in this release?</p><ul><li>Initial <strong>Jack Transport</strong> support;</li><li>many improvements to the Piano Roll Editor and MIDI output;</li><li>custom version of RtAudio shipped with the source package;</li><li>tons of bugs fixed and cleanups.</li></ul><p>Many thanks to our sweet supporters, with their ideas and precious suggestions.</p>"
	},
	{
		"title": "Giada Loop Machine 0.7.0",
		"date": "June 04, 2013",
		"body": "<p>Giada 0.7.0 <em>dark signals</em> is out today! This release celebrates the beginning of MIDI development, with a couple of delicious features:</p><ul><li><strong>VSTi</strong> (instrument) support;</li><li>new <strong>Piano Roll</strong> widget — in its infancy, but it rocks!</li></ul><p>As always, feel free to submit any thoughts or feedback to our <a href=\"http://www.giadamusic.com/forum\">friendly forum</a>, and remember to follow us on <a href=\"https://www.facebook.com/GiadaYourHardcoreLoopmachine\" title=\"Giada Loop Machine @ Facebook\">Facebook</a> and <a href=\"https://twitter.com/GiadaLooper\" title=\"Giada Loop Machine @ Facebook\">Twitter</a>. The documentation will be updated <em>very</em> soon.</p>"
	},
	{
		"title": "Giada on Youtube",
		"date": "May 28, 2013",
		"body": "<p>We are jubilant to announce our new Youtube channel <ahref=\"http://www.youtube.com/user/GiadaLoopMachine\"title=\"Giada @ Youtube\">GiadaLoopMachine</a>, and we do thatby uploading two great tutorial for beginners patientlyhandcrafted by our robotic friend Nesbit: <ahref=\"http://www.youtube.com/watch?v=Mt0aZWRfmZs\"title=\"Giada tutorial #1 - How to initialize a channel\">How to initialize a channel</a> and <a title=\"Giada tutorial #2:Basic beat/looper function\"href=\"http://www.youtube.com/watch?v=LjozgS_snMM\">Basicbeat/looper function</a>.</p>"
	},
	{
		"title": "Giada 0.6.4 released",
		"date": "May 07, 2013",
		"body": "<p>Giada 0.6.4 <em>switched at birth</em> is out! This release features lots of fixes, many memory leaks resolved, stability improvements, enhanced project portability and useful internal cleanups.</p><p>This version marks the end of the 0.6.x series; by the next episode we'll start to face the MIDI output and full VST Intrument support!</p>"
	},
	{
		"title": "Giada 0.6.3 released",
		"date": "April 23, 2013",
		"body": "<p>Giada 0.6.3 <em>split-brain</em> is out! Main features:<ul><li>New <strong>solo</strong> button;</li><li><strong>Portable project system</strong> — share works with the world;</li><li><strong>New 'Single Endless' channel mode</strong> — perfect for your drone music project;</li><li>GUI enhancements and minor fixes.</li></ul></p>"
	},
	{
		"title": "Giada 0.6.2 released",
		"date": "April 04, 2013",
		"body": "<p>Giada 0.6.2 <em>it can rain all the time</em> is out! Someof the key features:<ul><li>New <strong>volume envelope</strong> tool;</li><li><strong>Big enhancements inthe action editor</strong> — zoom with mouse wheel, GUI redesign and much more;</li><li>Many, many other improvements and bugs fixed.</li></ul></p>"
	},
	{
		"title": "Giada 0.6.1 released",
		"date": "March 22, 2013",
		"body": "<p>Giada 0.6.1 <em>spring edition</em> is finally available.This release features support for unlimited number of channels, as well as a deep internal refactoring. Enjoy thewarm sun and please report in our <a href=\"forum\" title=\"Giada Development Forum\">Development Forum</a> any bugs you might encounter!</p>"
	},
	{
		"title": "Giada @ makeuseof.com",
		"date": "March 18, 2013",
		"body": "<p><a href=\"http://www.makeuseof.com/dir/giada-an-audio-looping-cross-platform-application/\">Giada: An Audio Looping Cross-Platform Program</a> straight from <a href=\"http://www.makeuseof.com\">makeuseof.com</a>. Check it out!</p>"
	},
	{
		"title": "Giada 0.6.0 released!",
		"date": "March 01, 2013",
		"body": "<p>We are pleased to present to the masses Giada 0.6.0, thefirst version in the 0.6 series. What's new in thisrelease?</p><ul><li><strong>A revamped SampleEditor</strong> — with full screen support and zoom withmouse wheel;</li><li><strong>Sound bug in OS X</strong>fixed</li></ul><p>and many other small but interestingimprovements. <a href=\"href://www.giadamusic.com/download/\"title=\"Download Giada 0.6.0\">Download Giada 0.6.0</a> right now!</p>"
	},
	{
		"title": "Giada 0.5.8 is out...",
		"date": "February 06, 2013",
		"body": "<p>...and it marks the end of the 0.5 series. We are planningdelicious new features for Giada 0.6, such as a full-screenSample Editor, unlimited number of channels as well assquashing some nasty bugs, especially on OS X. But what'snew in this release?</p><ul><li><strong>Internal samplerateconversion</strong> — thanks to <ahref=\"http://www.mega-nerd.com/SRC/\"title=\"libsamplerate\">libsamplerate</a>, you can configurethe sample rate of your soundcard; samples will betransformed accordingly;</li><li><strong>New \"internal mute\"feature</strong> — <em>mute</em> actions work in a separatelayer and they no longer affect the mutebutton;</li><li><strong>Bring channels automatically to fullvolume on sample load</strong> — so comfortable!</li></ul><p></p>"
	},
	{
		"title": "Giada 0.5.7 released",
		"date": "January 21, 2013",
		"body": "<p>Giada 0.5.7 is now available. What's new?</p><ul><li>visual grid + snap to grid for the Action Editor</li><li>better zoom behavior in the Action Editor</li><li>enhanced VST support (many new opcodes implemented)</li><li>under-the-hood improvements and fixes</li></ul></p>"
	},
	{
		"title": "a change of address",
		"date": "January 06, 2013",
		"body": "<p>New year, new url: please update your bookmarks with the fresh new address http://www.giadamusic.com. How sweet :)</p>"
	},
	{
		"title": "Giada 0.5.6",
		"date": "January 02, 2013",
		"body": "<p>Say \"yeah\" to 2013 with the new version of Giada, now available for download. It features the new overdub mode for live recording, support for VST presets and many other optimizations and fixes. </p>"
	},
	{
		"title": "Giada 0.5.5 released",
		"date": "December 14, 2012",
		"body": "<p>Dear loopers, Giada version 0.5.5 is now available. What's new: </p><ul><li>\"Hear what you're playing\" feature;</li><li>Fx processing on the input side;</li><li>Ability to add different action types (Action Editor);</li><li>Desktop integration on Linux (via deb package);</li><li>Upgrade to FLTK 1.3.2.</li><p>Plus many other small fixes and optimizations.</p>"
	},
	{
		"title": "Giada 0.5.4 is out",
		"date": "November 24, 2012",
		"body": "<p>Giada version 0.5.4 is now available. What's new?</p><ul><li>VST GUI support + other plugin improvements</li><li>better subwindows management</li><li>graphical improvements in the Action Editor</li><li>tons of bugs fixed</li></ul><p></p>"
	},
	{
		"title": "Giada on GitHub",
		"date": "November 17, 2012",
		"body": "<p>Developers, programmers, coders, hackers: after years of waiting, we finally have a repository on GitHub! Take a look at the <a href=\"documentation-development-git-setup.php\">documentation page</a> and feel free to fork the source code on the <a href=\"https://github.com/monocasual/giada\">GitHub profile</a>.</p>"
	},
	{
		"title": "Welcome Giada 0.5.3 ",
		"date": "October 25, 2012",
		"body": "<p>Giada version 0.5.3 is now available. And it brings some good new features:</p><ul><li>Live beat manipulators;</li><li>a new sub-windows management;</li><li>new optional hard limiter on the output side.</li></ul><p>Plus many other fixes and optimizations. <a href=\"download\" title=\"Download Giada 0.5.3\">Download it</a>!</p></p>"
	},
	{
		"title": "Fresh new docs page",
		"date": "October 14, 2012",
		"body": "<p>We have finally readjusted the old and rusty <a href=\"documentation-index\" title=\"Giada docs\">documentation area</a>. There are also some features that we will publish in upcoming 0.5.3 version: try to find them!</p>"
	},
	{
		"title": "Giada 0.5.2 is out",
		"date": "October 04, 2012",
		"body": "<p>We are glad to announce another shiny version of Giada. What's new?<br /><br />- Add ability to handle actions for loop-mode channels;<br />- Add ability to record live mute actions for loop-mode channels;<br />- Lots of live action recording improvements;<br />- Enhanced usability for the action editor;<br />- More verbose output if kernel audio fails to start;<br />- Several internal optimizations.<br /><br />Happy looping!</p>"
	},
	{
		"title": "Giada 0.5.1 released",
		"date": "September 12, 2012",
		"body": "<p>A new version of Giada is now available, featuring an initial and naive implementation of the Action Editor. But it looks good!</p>"
	},
	{
		"title": "Sweet website improvements",
		"date": "September 09, 2012",
		"body": "<p>We have some new graphic stuff in our website. Get ready for the upcoming 0.5.1 version!</p>"
	},
	{
		"title": "Giada 0.5.0 released",
		"date": "July 23, 2012",
		"body": "<p>A new version of Giada is out! This version brings an advanced project folder system, some useful checks against duplicate filenames, lots ofminor improvements and celebrates the beginning of the 0.5series.</p>"
	},
	{
		"title": "News from Giada development",
		"date": "July 14, 2012",
		"body": "<p>Ladies and gentlemen, we are happy to announce the beginning of the 0.5 series. Lots of interesting stuff and features:</p><ul><li>the action editor</li><li>anti-aliased, hi-quality pitch controller</li><li>automatic internal resampling</li><li>enhanced patch browsing</li></ul><p>and many, many more. Get ready!</p>"
	},
	{
		"title": "Giada 0.4.13 released",
		"date": "July 09, 2012",
		"body": "<p>Giada 0.4.13 is available for download: this release fixes several bugs and marks the end of the 0.4 series. Get ready for many new exciting features!</p>"
	},
	{
		"title": "Giada 0.4.12 is out",
		"date": "July 01, 2012",
		"body": "<p>Giada 0.4.12 is available for download: VST parameters are now stored in patch files, PulseAudio support in Linux (thanks to RtAudio 4.0.11),revised .deb package and much more.</p>"
	},
	{
		"title": "Giada 0.4.11 released",
		"date": "June 10, 2012",
		"body": "<p>Giada 0.4.11 is available for download! What's new: VST stack for each channel, custom paths for samples, patches, plugins and the usual bug fixing.</p>"
	},
	{
		"title": "Giada on Tumblr",
		"date": "June 09, 2012",
		"body": "<p>Today we have launched <a href=\"http://giadaloopmachine.tumblr.com\">Giada on Tumblr</a>: a strange blog where we collect music, videos, pictures and tech news from the world. Just for fun :)</p>"
	},
	{
		"title": "Giada 0.4.10 is out",
		"date": "May 29, 2012",
		"body": "<p>A new version of Giada is available. Top features: ability to shift up and down VST plugins in the stack, an enhanced patch system, lots of potential crashes fixed while adding and removing VST. Plus, of course, a good number of bugs squashed.</p>"
	},
	{
		"title": "Giada 0.4.9 released",
		"date": "May 12, 2012",
		"body": "<p>A new version of Giada is finally available. Key features: no more mandatory inputs, enhanced audio layer, lots of usability improvements, tons of bugs fixed.</p>"
	},
	{
		"title": "Giada review",
		"date": "May 04, 2012",
		"body": "<p>A couple of days ago, our beloved Louigi Verona did a great review of Giada on his web space. <a href=http://www.louigiverona.ru/?page=projects&s=writings&t=linux&a=linux_giada>LinuxAudio: Giada - looper for live performances</a>.</p>"
	},
	{
		"title": "docs updated",
		"date": "April 30, 2012",
		"body": "<p>We finally have updated our online manual! VST section, better pagination, new stuff. <a href=\"documentation-index\">Check it out</a>.</p>"
	},
	{
		"title": "Giada 0.4.8 released, VST time!",
		"date": "April 21, 2012",
		"body": "<p>Giada version 0.4.8 is now available. What's new in this release: <ul> <li>experimental VST support</li><li>raw pitch controller (no resampling)</li><li>Minor enhancements and bugfixing</li> </ul></p>"
	},
	{
		"title": "Giada 0.4.7 released!",
		"date": "March 31, 2012",
		"body": "<p>Giada version 0.4.7 is now available. What's new in this release?<ul><li>Enhanced waveform editor featuring cut, trim and silencetools</li><li>Lots of waveform drawing speedups</li><li>Fixed compilation on 64 bit systems</li></ul></p>"
	},
	{
		"title": "Giada 0.4.6 released",
		"date": "March 11, 2012",
		"body": "<p>Giada 0.4.6 is now available. This release fixes a critical bug that was causing the audio devices to be listed incorrectly, plus some other interesting changes.</p>"
	},
	{
		"title": "New development area",
		"date": "March 09, 2012",
		"body": "<p>We finally have a place where to submit bugs and suggest new features: a phpBB forum used as a development tracker. <a href=\"forum\">Join us</a>!</p>"
	},
	{
		"title": "Giada 0.4.5 released!",
		"date": "February 25, 2012",
		"body": "<p>We are very happy to announce the new release of our beloved Giada, along with a refreshed website. What's new in this version:<br /></p><ul><li>a complete GUI redesign</li><li>multiple usability improvements</li><li>tons of bugs fixed</li></ul><p>Download it as soon as you can. </p>"
	}
]